<a href="https://colab.research.google.com/github/junio-firmino/Aprendizado_python/blob/master/boston.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [45]:
import pandas as pd
import numpy as np

In [46]:
boston_url = '/content/drive/MyDrive/2017BostonMarathonTop1000.csv'

In [47]:
boston = pd.read_csv(boston_url)

In [48]:
boston

                    Name  Age M/F  ... Overall Gender  Years Ran
0       Kirui, Geoffrey    24   M  ...       1      1        NaN
1         Rupp, Galen      30   M  ...       2      2        NaN
2        Osako, Suguru     25   M  ...       3      3        NaN
3       Biwott, Shadrack   32   M  ...       4      4        NaN
4         Chebet, Wilson   31   M  ...       5      5       2015
..                   ...  ...  ..  ...     ...    ...        ...
995         Larosa, Mark   38   M  ...     996    940  2015:2016
996  Williamson, Jerry A   43   M  ...     997    941       2015
997      Mccue, Daniel T   40   M  ...     998    942        NaN
998         Larosa, John   35   M  ...     999    943        NaN
999       Sanchez, Sam R   35   M  ...    1000    944        NaN

[1000 rows x 10 columns]

In [49]:
boston.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           1000 non-null   object
 1   Age            1000 non-null   int64
 2   M/F            1000 non-null   object
 3   City           1000 non-null   object
 4   State          807 non-null    object
 5   Country        1000 non-null   object
 6   Official Time  1000 non-null   object
 7   Overall        1000 non-null   int64
 8   Gender         1000 non-null   int64
 9   Years Ran      315 non-null    object
dtypes: int64(3), object(7)
memory usage: 78.2+ KB

In [50]:
boston.isna().agg('sum')   # Achar a quantidade de NA`s de um dataframe por cada coluna

Name               0
Age                0
M/F                0
City               0
State            193
Country            0
Official Time      0
Overall            0
Gender             0
Years Ran        685
dtype: int64

In [51]:
boston.head(5)

                Name  Age M/F  ... Overall Gender Years Ran
0   Kirui, Geoffrey    24   M  ...       1      1       NaN
1     Rupp, Galen      30   M  ...       2      2       NaN
2    Osako, Suguru     25   M  ...       3      3       NaN
3   Biwott, Shadrack   32   M  ...       4      4       NaN
4     Chebet, Wilson   31   M  ...       5      5      2015

[5 rows x 10 columns]

In [52]:
boston.Name.str.split(expand=True)

               0         1     2     3     4
0         Kirui,  Geoffrey  None  None  None
1          Rupp,     Galen  None  None  None
2         Osako,    Suguru  None  None  None
3        Biwott,  Shadrack  None  None  None
4        Chebet,    Wilson  None  None  None
..           ...       ...   ...   ...   ...
995      Larosa,      Mark  None  None  None
996  Williamson,     Jerry     A  None  None
997       Mccue,    Daniel     T  None  None
998      Larosa,      John  None  None  None
999     Sanchez,       Sam     R  None  None

[1000 rows x 5 columns]

In [53]:
boston['horas']=boston['Official Time'].str.replace(r'(\d+):(\d+):(\d+)', r'\1')

In [54]:
boston['minutos']=boston['Official Time'].str.replace(r'(\d+):(\d+):(\d+)', r'\2')

In [55]:
boston['segundos']=boston['Official Time'].str.replace(r'(\d+):(\d+):(\d+)', r'\3')

In [56]:
boston

                    Name  Age M/F  ... horas minutos segundos
0       Kirui, Geoffrey    24   M  ...     2      09       37
1         Rupp, Galen      30   M  ...     2      09       58
2        Osako, Suguru     25   M  ...     2      10       28
3       Biwott, Shadrack   32   M  ...     2      12       08
4         Chebet, Wilson   31   M  ...     2      12       35
..                   ...  ...  ..  ...   ...     ...      ...
995         Larosa, Mark   38   M  ...     2      56       06
996  Williamson, Jerry A   43   M  ...     2      56       06
997      Mccue, Daniel T   40   M  ...     2      56       06
998         Larosa, John   35   M  ...     2      56       07
999       Sanchez, Sam R   35   M  ...     2      56       08

[1000 rows x 13 columns]

In [57]:
final_times = boston['Official Time'].str.split(':',expand=True,)

In [58]:
final_times

     0   1   2
0    2  09  37
1    2  09  58
2    2  10  28
3    2  12  08
4    2  12  35
..  ..  ..  ..
995  2  56  06
996  2  56  06
997  2  56  06
998  2  56  07
999  2  56  08

[1000 rows x 3 columns]

In [59]:
final_times.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       1000 non-null   object
 1   1       1000 non-null   object
 2   2       1000 non-null   object
dtypes: object(3)
memory usage: 23.6+ KB

In [60]:
final_times=final_times.select_dtypes(include='object').astype('int')   # Selection many columns the same type and change the type.

In [61]:
final_times.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       1000 non-null   int64
 1   1       1000 non-null   int64
 2   2       1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [62]:
final_times['total'] = final_times[0]*3600 + final_times[1]*60+final_times[2]

In [63]:
final_times

     0   1   2  total
0    2   9  37   7777
1    2   9  58   7798
2    2  10  28   7828
3    2  12   8   7928
4    2  12  35   7955
..  ..  ..  ..    ...
995  2  56   6  10566
996  2  56   6  10566
997  2  56   6  10566
998  2  56   7  10567
999  2  56   8  10568

[1000 rows x 4 columns]

In [64]:
boston.insert(boston.columns.get_loc('State')+2,'Total Time', final_times.total)

In [65]:
boston

                    Name  Age M/F  ... horas minutos segundos
0       Kirui, Geoffrey    24   M  ...     2      09       37
1         Rupp, Galen      30   M  ...     2      09       58
2        Osako, Suguru     25   M  ...     2      10       28
3       Biwott, Shadrack   32   M  ...     2      12       08
4         Chebet, Wilson   31   M  ...     2      12       35
..                   ...  ...  ..  ...   ...     ...      ...
995         Larosa, Mark   38   M  ...     2      56       06
996  Williamson, Jerry A   43   M  ...     2      56       06
997      Mccue, Daniel T   40   M  ...     2      56       06
998         Larosa, John   35   M  ...     2      56       07
999       Sanchez, Sam R   35   M  ...     2      56       08

[1000 rows x 14 columns]